Update README and architecture
